# Реализуйте алгоритм перемешивания списка.

import os

os.system('cls')

print('Давайте перемешаем список случайным образом.')

a = map(float, input('Введите список чисел через пробел: ').split())

a = list(a)

